[
	{
		"id": 1,
		"sentence": "My name ___ Ahmed.",
		"correct": ["is"],
		"explanation_ar": "اسأل نفسك: هل الجملة تعريف/وصف؟ نعم. بالإنجليزي لازم فعل يربط بين شيين: (My name) و (Ahmed). بدون (is) الجملة تبقى ناقصة لأن الإنكليزي ما يقبل اسمين بدون رابط."
	},
	{
		"id": 2,
		"sentence": "I ___ from Iraq.",
		"correct": ["am"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة تعريف/وصف؟ نعم: (أنا) + (من العراق). بالعربي ممكن نقول «أنا من العراق» بدون فعل. بس بالإنجليزي هذا غير مسموح. لازم فعل يربط بين (I) و (from Iraq). ويا (I) نستخدم (am) دائماً. بدون (am) الجملة ما تعتبر جملة بالإنجليزي لأن ماكو فعل."
	},
	{
		"id": 3,
		"sentence": "They ___ my neighbours.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة تعريف/وصف؟ نعم: (They) = (my neighbours). بالإنجليزي ما يصير نحط اسمين بدون فعل ربط. بعدها نختار الفعل الصحيح حسب الفاعل، ويا (They) نستخدم (are)."
	},
	{
		"id": 4,
		"sentence": "She ___ a teacher.",
		"correct": ["is"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة تعريف/وصف؟ نعم: (هي) = (معلمة). بالعربي ممكن نقول «هي معلمة» بدون فعل. بس بالإنجليزي لازم فعل يربط بين (She) و (a teacher). بدون (is) الجملة ما تعتبر جملة لأن ماكو فعل يربط الطرفين."
	},
	{
		"id": 5,
		"sentence": "I have ___ job.",
		"correct": ["a"],
		"explanation_ar": "اسأل نفسك: الاسم مفرد؟ نعم: (job). الاسم المفرد بالإنجليزي يحتاج محدِّد: (a/an). هنا (a) لأنك تقصد وظيفة وحدة غير محددة."
	},
	{
		"id": 6,
		"sentence": "The shop is ___ the city.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: العلاقة مكانية؟ نعم. (in) معناها داخل/ضمن، تربط (shop) بـ (city) وتوضح إنه داخل المدينة. بدون (in) ما نعرف العلاقة."
	},
	{
		"id": 7,
		"sentence": "I go ___ work every day.",
		"correct": ["to"],
		"explanation_ar": "اسأل نفسك: فعل حركة؟ (go) نعم. الحركة تحتاج وجهة، و(to) هي كلمة الوجهة: تروح إلى وين؟ (to) تربط الذهاب بالهدف (work)."
	},
	{
		"id": 8,
		"sentence": "I live ___ Cardiff.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: سكن داخل مكان؟ نعم. ويا المدن عادة نقول (live in + city). (in) تبين إن سكنك داخل المدينة، مو بس ذكر اسمها."
	},
	{
		"id": 9,
		"sentence": "I live ___ my family.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: بعد الفعل أشخاص لو مكان؟ هنا أشخاص. (with) معناها (ويا/مع) وتبين إنك تعيش معهم، مو داخلهم أو قريب منهم."
	},
	{
		"id": 10,
		"sentence": "I like tea ___ coffee.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندي شيين أريد أجمعهم؟ نعم. (and) تربط عنصرين بنفس الجملة: tea + coffee. بدون (and) يصير الكلام مقطوع."
	},
	{
		"id": 11,
		"sentence": "___ you like reading?",
		"correct": ["Do"],
		"explanation_ar": "اسأل نفسك: هذا سؤال لو خبر؟ سؤال. بالإنجليزي السؤال بالحاضر يحتاج كلمة مساعدة (auxiliary verb) بالبداية. (Do) هي الكلمة المساعدة للسؤال مع (you/I/we/they). بدون (Do) الجملة تصير خبرية: (you like reading) = أنت تحب القراءة (مو سؤال). (Do) تثبت إن هذا سؤال وتغير المعنى من خبر إلى سؤال."
	},
	{
		"id": 12,
		"sentence": "What ___ you do at the weekend?",
		"correct": ["do"],
		"explanation_ar": "حتى نسوي سؤال بالحاضر نحتاج مساعد: (What + do + you + verb). (do) يثبت إن هذا سؤال، والفعل يبقى بصيغته الأساسية بعده. بدون (do) التركيب ينكسر."
	},
	{
		"id": 13,
		"sentence": "___ she work in a shop?",
		"correct": ["Does"],
		"explanation_ar": "ويا (she/he/it) بالسؤال نستخدم (Does): (Does + she + verb). بعد (Does) الفعل يبقى أساس (work) بدون s لأن الـ s تروح ويا (Does). هذا ترتيب السؤال بالحاضر."
	},
	{
		"id": 14,
		"sentence": "She works ___ a hospital.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: شغل داخل مكان؟ نعم. (in) تربط العمل بالمكان وتوضح إنها تشتغل داخل المستشفى. بدون (in) المكان مذكور بس العلاقة مو واضحة."
	},
	{
		"id": 15,
		"sentence": "I talk ___ my neighbours.",
		"correct": ["to"],
		"explanation_ar": "اسأل نفسك: الكلام يروح لمن؟ لازم جهة. (to) تربط الكلام بالشخص المستلِم: talk to someone. بدون (to) تصير الجملة غير منطقية بالإنجليزي."
	},
	{
		"id": 16,
		"sentence": "They are ___ the house.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: نحدد موقعهم لو نعرّفهم؟ هنا موقع. (are) يربطهم ببعض، بس لازم نحدد وين هم. (in) حرف جر يبين العلاقة المكانية: داخل البيت. بدون (in) الجملة (They are the house) معناها (هم = البيت) وهذا خطأ. (in) ضروري حتى نعرف إنهم داخل المكان، مو إنهم هم المكان نفسه."
	},
	{
		"id": 17,
		"sentence": "She is ___ engineer.",
		"correct": ["an"],
		"explanation_ar": "اسأل نفسك: (engineer) اسم مفرد لو جمع؟ مفرد. بالإنجليزي الاسم المفرد لازم محدد (a/an/the) قبله. هذا قاعدة ثابتة: ما نكدر نقول (She is engineer) بدون محدد. نستخدم (an) لأن (engineer) يبدأ بصوت علّة (e). الفكرة المهمة: مو لأن (engineer) يحتاج (an) حفظاً، بل لأن الاسم المفرد بالإنجليزي يحتاج محدد دائماً."
	},
	{
		"id": 18,
		"sentence": "I go ___ the market.",
		"correct": ["to"],
		"explanation_ar": "اسأل نفسك: go فعل حركة؟ نعم. لازم وجهة، و(to) تربط الحركة بالمكان الهدف: go to the market. بدون (to) يبقى (أروح) بدون (إلى وين؟)."
	},
	{
		"id": 19,
		"sentence": "He lives ___ his parents.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: بعد (lives) مكان لو أشخاص؟ هنا أشخاص. بالإنجليزي لما نحچي عن العيش ويا ناس، لازم حرف جر يبين العلاقة. (with) معناها (ويا/مع) وتبين إنه يعيش معهم، مو داخلهم أو قريب منهم. بدون (with) الجملة (He lives his parents) ماكو معنى واضح لأن ما نعرف العلاقة بينه وبينهم."
	},
	{
		"id": 20,
		"sentence": "The school is ___ the city.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: نحدد موقع المدرسة لو نعرّفها؟ هنا موقع. (is) يربط المدرسة بوصف، بس لازم نحدد وين هي. (in) حرف جر يبين العلاقة المكانية: المدرسة داخل المدينة. بدون (in) الجملة (The school is the city) معناها (المدرسة = المدينة) وهذا خطأ. (in) ضروري حتى نعرف موقع المدرسة، مو إنها هي المدينة نفسها."
	},
	{
		"id": 21,
		"sentence": "He ___ a student.",
		"correct": ["is"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة تعريف/وصف؟ نعم: (هو) = (طالب). بالعربي ممكن نقول «هو طالب» بدون فعل. بس بالإنجليزي لازم فعل يربط بين (He) و (a student). بدون (is) الجملة ما تعتبر جملة لأن ماكو فعل يربط الطرفين."
	},
	{
		"id": 22,
		"sentence": "We ___ friends.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك أولاً: هل نعرّف نفسنا أو نصف علاقة؟ نعم: (نحن أصدقاء). بالإنجليزي لازم فعل ربط بين (We) و (friends). بعدين نختار الشكل الصحيح للفعل، ويا (We) نستخدم (are). بدون الفعل الجملة ما تعتبر جملة."
	},
	{
		"id": 23,
		"sentence": "I need ___ book.",
		"correct": ["a"],
		"explanation_ar": "اسأل نفسك: book مفرد؟ نعم، إذن يحتاج (a/an). هنا (a) لأن المعنى (كتاب واحد مو محدد). مو لأن (need) يحتاجها، بل لأن الاسم يحتاجها."
	},
	{
		"id": 24,
		"sentence": "She goes ___ school every morning.",
		"correct": ["to"],
		"explanation_ar": "goes فعل حركة، فلازم وجهة. (to) تربط الذهاب بالمكان: go to school. بدون (to) يبقى السؤال: تروح لوين؟"
	},
	{
		"id": 25,
		"sentence": "The cat is ___ the box.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: داخل لو فوق لو تحت؟ (in) تختارها لما الشيء داخل. (in) تربط القطة بالصندوق وتحدد العلاقة. بدونها ماكو معنى مكاني واضح."
	},
	{
		"id": 26,
		"sentence": "I like apples ___ oranges.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الجملة؟ نعم: التفاح والبرتقال. بالإنجليزي لما عندك عنصرين أو أكثر بنفس الجملة، لازم كلمة ربط (conjunction) تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I like apples oranges) ماكو معنى واضح لأن العناصر منفصلة بدون رابط."
	},
	{
		"id": 27,
		"sentence": "He works ___ his brother.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: يعمل وحده لو ويا أحد؟ هنا ويا شخص. (with) معناها (مع/ويا) وتبين المشاركة بالشغل. بدونها العلاقة مو واضحة."
	},
	{
		"id": 28,
		"sentence": "I wake up ___ 7 o'clock.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (7 o'clock). بالإنجليزي الأوقات المحددة (مثل 7 o'clock, 9 am, 12 noon) تحتاج حرف جر قبلها. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (I wake up 7 o'clock) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 29,
		"sentence": "I wait ___ the bus.",
		"correct": ["for"],
		"explanation_ar": "اسأل نفسك: أنت تنتظر شنو؟ لازم هدف للانتظار. (for) تربط (wait) بالشيء المنتظَر: wait for the bus. بدون (for) يبقى: أنتظر... شنو؟"
	},
	{
		"id": 30,
		"sentence": "I drink tea ___ I am tired.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أشرب شاي) و (أكون متعب). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن شرب الشاي يصير بوقت التعب. لا تخلطها بـ (if) لأن (if) شرط (إذا)، أما (when) وقت (لما). بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 31,
		"sentence": "You ___ my friend.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة تعريف؟ نعم: (أنت صديقي). بالإنجليزي ما نكدر نقول اسم + اسم بدون رابط. نحتاج فعل ربط، ومع (you) نستخدم (are). بدون (are) الكلام يشبه العربية لكنه خطأ بالإنجليزي."
	},
	{
		"id": 32,
		"sentence": "She ___ happy today.",
		"correct": ["is"],
		"explanation_ar": "اسأل نفسك: (happy) صفة لو فعل؟ صفة. بالعربي ممكن نقول «هي سعيدة» بدون فعل واضح. بس بالإنجليزي الصفة ما تجي وحدها بعد الاسم. لازم فعل ربط يربط الاسم بالصفة. (is) يربط (She) بالصفة (happy). بدون (is) الجملة (She happy) غير صحيحة لأن الصفة معلّقة بدون فعل يربطها بالاسم."
	},
	{
		"id": 33,
		"sentence": "I want ___ apple.",
		"correct": ["an"],
		"explanation_ar": "apple اسم مفرد، فلازم (a/an). نستخدم (an) لأن بداية الكلمة صوت علّة. مو لأن (want) يحتاجها، بل لأن الاسم المفرد يحتاج محدد."
	},
	{
		"id": 34,
		"sentence": "They go ___ the park.",
		"correct": ["to"],
		"explanation_ar": "go فعل حركة، فلازم وجهة. (to) تربط الذهاب بالمكان الهدف: go to the park. بدون (to) تبقى الحركة بدون اتجاه."
	},
	{
		"id": 35,
		"sentence": "The book is ___ the drawer.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: الشيء داخل المكان؟ نعم. (in) معناها داخل وتربط الكتاب بالدرج. بدون (in) ما نعرف مكان الكتاب."
	},
	{
		"id": 36,
		"sentence": "I eat bread ___ butter.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الفعل؟ نعم: الخبز والزبدة. بالإنجليزي لما عندك عنصرين بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I eat bread butter) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة."
	},
	{
		"id": 37,
		"sentence": "She studies ___ her friend.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: تدرس وحدها لو ويا أحد؟ هنا ويا شخص. (with) تبين المشاركة: studies with her friend. بدون (with) العلاقة مو واضحة."
	},
	{
		"id": 38,
		"sentence": "We meet ___ 3 o'clock.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (3 o'clock). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (We meet 3 o'clock) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 39,
		"sentence": "I look ___ my keys.",
		"correct": ["for"],
		"explanation_ar": "اسأل نفسك: (look) يحتاج هدف لو لا؟ هنا نعم. (look) معناها (أبحث) مو (أنظر). بالإنجليزي لما تبحث، لازم تقول عن شنو تبحث. (for) تربط البحث بالهدف: look for my keys. بدون (for) الجملة (I look my keys) ماكو معنى واضح لأن ما نعرف عن شنو تبحث. (for) ضروري حتى يكتمل المعنى."
	},
	{
		"id": 40,
		"sentence": "I call you ___ I arrive.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أتصل) و (أوصل). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن الاتصال يصير بوقت الوصول. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 41,
		"sentence": "It ___ a nice day.",
		"correct": ["is"],
		"explanation_ar": "بالعربي نكدر نقول: «اليوم جميل» بدون فعل. بالإنجليزي هذا غير مسموح. إذا عندك اسم + وصف/تعريف، لازم فعل ربط. هنا (It) مربوط بـ (a nice day) بواسطة (is)."
	},
	{
		"id": 42,
		"sentence": "We ___ students.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة تعريف؟ نعم: (نحن طلاب). بالإنجليزي التعريف يحتاج فعل يربط بين الطرفين. بعد ما نعرف أننا نحتاج فعل ربط، نختار الصحيح حسب الفاعل: ويا (We) نستخدم (are)."
	},
	{
		"id": 43,
		"sentence": "I see ___ dog in the street.",
		"correct": ["a"],
		"explanation_ar": "dog اسم مفرد، فلازم (a/an). هنا (a) لأنك تقصد كلب واحد غير محدد. تذكر: المحدد يخص الاسم، مو الفعل."
	},
	{
		"id": 44,
		"sentence": "He walks ___ work.",
		"correct": ["to"],
		"explanation_ar": "walks حركة، ولازم وجهة. (to) تربط المشي بالمكان الهدف: walk to work. بدون (to) يبقى: يمشي... لوين؟"
	},
	{
		"id": 45,
		"sentence": "The pen is ___ my bag.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: داخل الحقيبة؟ نعم. (in) معناها داخل وتربط القلم بالحقيبة. بدون (in) ما نعرف مكان القلم."
	},
	{
		"id": 46,
		"sentence": "I buy milk ___ eggs.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الفعل؟ نعم: الحليب والبيض. بالإنجليزي لما عندك عنصرين بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I buy milk eggs) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة للشراء."
	},
	{
		"id": 47,
		"sentence": "They play ___ their friends.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: يلعبون وحدهم لو ويا ناس؟ هنا ويا ناس. (with) تبين المشاركة: play with their friends. بدونها العلاقة ناقصة."
	},
	{
		"id": 48,
		"sentence": "She arrives ___ 9 am.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (9 am). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (She arrives 9 am) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 49,
		"sentence": "I ask ___ help.",
		"correct": ["for"],
		"explanation_ar": "ask هنا يعني (أطلب)، فلازم تقول شنو تطلب. (for) تربط الطلب بالشيء المطلوب: ask for help. بدون (for) يبقى: أطلب... شنو؟"
	},
	{
		"id": 50,
		"sentence": "I sleep ___ I am tired.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أنام) و (أكون متعب). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن النوم يصير بوقت التعب. إذا تريد شرط (إذا تعبت) هذا (if)، بس هنا المقصود وقت. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 51,
		"sentence": "The teacher ___ kind.",
		"correct": ["is"],
		"explanation_ar": "اسأل نفسك: (kind) صفة لو فعل؟ صفة. بالعربي ممكن نقول «المعلم لطيف» بدون فعل واضح. بس بالإنجليزي الصفة ما تجي وحدها بعد الاسم. لازم فعل ربط يربط الاسم بالصفة. (is) يربط (The teacher) بالصفة (kind). بدون (is) الجملة (The teacher kind) غير صحيحة لأن الصفة معلّقة بدون فعل يربطها بالاسم."
	},
	{
		"id": 52,
		"sentence": "You ___ very smart.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة وصف؟ نعم: (أنت ذكي). بالإنجليزي الصفة ما تجي وحدها بعد الاسم، لازم فعل ربط. نضيف (are) حتى نربط (you) بالصفة (smart)."
	},
	{
		"id": 53,
		"sentence": "I have ___ idea.",
		"correct": ["an"],
		"explanation_ar": "اسأل نفسك: (idea) اسم مفرد لو جمع؟ مفرد. بالإنجليزي الاسم المفرد لازم محدد (a/an/the) قبله. هذا قاعدة ثابتة: ما نكدر نقول (I have idea) بدون محدد. نستخدم (an) لأن (idea) يبدأ بصوت علّة (i). تذكر: الاختيار حسب الصوت مو حسب الكتابة."
	},
	{
		"id": 54,
		"sentence": "We travel ___ London.",
		"correct": ["to"],
		"explanation_ar": "travel حركة/سفر، فلازم وجهة. (to) تربط السفر بالمكان الهدف: travel to London. بدون (to) يبقى السفر بلا اتجاه."
	},
	{
		"id": 55,
		"sentence": "The keys are ___ the drawer.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: المفاتيح داخل الدرج؟ نعم. (in) تبين داخل وتربط الشيء بالمكان. بدون (in) ما نعرف مكانها."
	},
	{
		"id": 56,
		"sentence": "I like pizza ___ pasta.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الجملة؟ نعم: البيتزا والمعكرونة. بالإنجليزي لما عندك عنصرين أو أكثر بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I like pizza pasta) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة."
	},
	{
		"id": 57,
		"sentence": "He eats ___ his family.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: يأكل وحده لو ويا ناس؟ هنا ويا ناس. (with) تبين المشاركة: eats with his family. بدونها العلاقة مو واضحة."
	},
	{
		"id": 58,
		"sentence": "I finish work ___ 5 pm.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (5 pm). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (I finish work 5 pm) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 59,
		"sentence": "I search ___ my phone.",
		"correct": ["for"],
		"explanation_ar": "اسأل نفسك: (search) يحتاج هدف لو لا؟ يحتاج هدف. (search) يعني (أبحث)، ولازم تقول عن شنو تبحث. (for) تربط البحث بالهدف: search for my phone. بدون (for) الجملة (I search my phone) ماكو معنى واضح لأن ما نعرف عن شنو تبحث. مو لأن (search لازم for) حفظاً، بل لأنك لازم تقول (أبحث عن ماذا) حتى يكتمل المعنى."
	},
	{
		"id": 60,
		"sentence": "I smile ___ I see you.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أبتسم) و (أشوفك). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن الابتسامة تصير بوقت الرؤية. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 61,
		"sentence": "The car ___ red.",
		"correct": ["is"],
		"explanation_ar": "red صفة. بالإنجليزي ما نكدر نقول اسم + صفة بدون فعل. لازم فعل ربط يربط السيارة بلونها. لذلك نستخدم (is) حتى تكون الجملة صحيحة."
	},
	{
		"id": 62,
		"sentence": "They ___ good people.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل نصفهم؟ نعم. الوصف بالإنجليزي يحتاج فعل ربط. بعد ما نقرر إن الفعل ضروري، نختار شكله حسب الفاعل. ويا (They) نستخدم (are)."
	},
	{
		"id": 63,
		"sentence": "I need ___ umbrella.",
		"correct": ["an"],
		"explanation_ar": "اسأل نفسك: (umbrella) اسم مفرد لو جمع؟ مفرد. بالإنجليزي الاسم المفرد لازم محدد (a/an/the) قبله. هذا قاعدة ثابتة: ما نكدر نقول (I need umbrella) بدون محدد. نستخدم (an) لأن (umbrella) يبدأ بصوت علّة (u). تذكر: الاختيار حسب الصوت مو حسب الكتابة."
	},
	{
		"id": 64,
		"sentence": "She runs ___ the shop.",
		"correct": ["to"],
		"explanation_ar": "run حركة، فلازم وجهة. (to) تربط الركض بالمكان الهدف: run to the shop. بدون (to) يبقى: تركض... لوين؟"
	},
	{
		"id": 65,
		"sentence": "The money is ___ the wallet.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: المال داخل المحفظة؟ نعم. (in) تبين داخل وتربط الشيء بالمكان. بدونها ما نعرف موقع المال."
	},
	{
		"id": 66,
		"sentence": "I drink water ___ juice.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الفعل؟ نعم: الماء والعصير. بالإنجليزي لما عندك عنصرين بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I drink water juice) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة للشرب."
	},
	{
		"id": 67,
		"sentence": "We study ___ our teacher.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: بعد (study) مكان لو أشخاص؟ هنا أشخاص. بالإنجليزي لما نحچي عن الدراسة ويا ناس، لازم حرف جر يبين العلاقة. (with) معناها (ويا/مع) وتبين إننا ندرس مع المعلم، يعني بشراكته. بدون (with) الجملة (We study our teacher) معناها (ندرس المعلم) وهذا خطأ. (with) ضروري حتى نعرف إننا ندرس معه، مو إننا ندرسه."
	},
	{
		"id": 68,
		"sentence": "He starts ___ 8 o'clock.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (8 o'clock). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (He starts 8 o'clock) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 69,
		"sentence": "I pay ___ the food.",
		"correct": ["for"],
		"explanation_ar": "اسأل نفسك: تدفع مقابل شنو؟ لازم هدف للدفع. (for) تربط الدفع بالشيء المدفوع عليه: pay for the food. بدونها يصير المعنى مبهم."
	},
	{
		"id": 70,
		"sentence": "I laugh ___ I watch comedy.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أضحك) و (أشاهد كوميديا). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن الضحك يصير بوقت المشاهدة. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 71,
		"sentence": "The door ___ open.",
		"correct": ["is"],
		"explanation_ar": "open هنا حالة/صفة، مو فعل. بالإنجليزي الحالة لازم تنربط بالاسم بفعل. (is) يربط (The door) بالحالة (open). بدون الفعل الجملة غير مكتملة."
	},
	{
		"id": 72,
		"sentence": "You ___ right.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل هذه جملة حكم/وصف؟ نعم. بالإنجليزي الحكم يحتاج فعل ربط. نضيف (are) حتى نربط (you) بالحكم (right). بدونها الكلام غير صحيح."
	},
	{
		"id": 73,
		"sentence": "I see ___ elephant.",
		"correct": ["an"],
		"explanation_ar": "اسأل نفسك: (elephant) اسم مفرد لو جمع؟ مفرد. بالإنجليزي الاسم المفرد لازم محدد (a/an/the) قبله. هذا قاعدة ثابتة: ما نكدر نقول (I see elephant) بدون محدد. نستخدم (an) لأن (elephant) يبدأ بصوت علّة (e). تذكر: الاختيار حسب الصوت مو حسب الكتابة."
	},
	{
		"id": 74,
		"sentence": "They move ___ a new house.",
		"correct": ["to"],
		"explanation_ar": "move انتقال، فلازم وجهة. (to) تربط الانتقال بالمكان الجديد: move to a new house. بدون (to) يبقى: ينتقلون... لوين؟"
	},
	{
		"id": 75,
		"sentence": "The shoes are ___ the box.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: الأحذية داخل الصندوق؟ نعم. (in) تبين داخل وتربط الشيء بالمكان. بدون (in) ما نعرف مكانها."
	},
	{
		"id": 76,
		"sentence": "I want coffee ___ tea.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الجملة؟ نعم: القهوة والشاي. بالإنجليزي لما عندك عنصرين بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I want coffee tea) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة للرغبة."
	},
	{
		"id": 77,
		"sentence": "She cooks ___ her mother.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: تطبخ وحدها لو ويا أحد؟ هنا ويا شخص. (with) تبين المشاركة: cooks with her mother. بدونها العلاقة مو واضحة."
	},
	{
		"id": 78,
		"sentence": "I leave ___ 6 pm.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (6 pm). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (I leave 6 pm) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 79,
		"sentence": "I thank you ___ your help.",
		"correct": ["for"],
		"explanation_ar": "الشكر يحتاج سبب/شيء تشكر عليه. (for) تربط الشكر بالسبب: thank you for your help. بدونها يبقى: أشكرك... على شنو؟"
	},
	{
		"id": 80,
		"sentence": "I cry ___ I am sad.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أبچي) و (أكون حزين). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن البكاء يصير بوقت الحزن. إذا تقصد شرط (إذا صرت حزين) هذا (if)، لكن هنا وقت. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 81,
		"sentence": "The window ___ closed.",
		"correct": ["is"],
		"explanation_ar": "closed حالة. بالإنجليزي الحالات تحتاج فعل يربطها بالاسم. نستخدم (is) حتى نربط (window) بالحالة (closed). بدون الفعل الجملة تبقى ناقصة."
	},
	{
		"id": 82,
		"sentence": "We ___ ready.",
		"correct": ["are"],
		"explanation_ar": "ready صفة، مو فعل. الصفة بالإنجليزي ما تجي وحدها، لازم فعل ربط. بعد ما نعرف إن الفعل ضروري، نختار الشكل الصحيح: ويا (We) نستخدم (are)."
	},
	{
		"id": 83,
		"sentence": "I have ___ orange.",
		"correct": ["an"],
		"explanation_ar": "اسأل نفسك: (orange) اسم مفرد لو جمع؟ مفرد. بالإنجليزي الاسم المفرد لازم محدد (a/an/the) قبله. هذا قاعدة ثابتة: ما نكدر نقول (I have orange) بدون محدد. نستخدم (an) لأن (orange) يبدأ بصوت علّة (o). تذكر: الاختيار حسب الصوت مو حسب الكتابة."
	},
	{
		"id": 84,
		"sentence": "He drives ___ the office.",
		"correct": ["to"],
		"explanation_ar": "drive حركة باتجاه مكان، فلازم وجهة. (to) تربط القيادة بالمكان الهدف: drive to the office. بدون (to) يبقى: يسوق... لوين؟"
	},
	{
		"id": 85,
		"sentence": "The flowers are ___ the vase.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: الزهور داخل المزهرية؟ نعم. (in) تبين داخل وتربط الشيء بالمكان. بدون (in) ماكو معنى واضح للمكان."
	},
	{
		"id": 86,
		"sentence": "I eat rice ___ chicken.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الفعل؟ نعم: الأرز والدجاج. بالإنجليزي لما عندك عنصرين بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I eat rice chicken) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة للأكل."
	},
	{
		"id": 87,
		"sentence": "They dance ___ their friends.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: يرقصون وحدهم لو ويا ناس؟ هنا ويا ناس. (with) تبين المشاركة: dance with their friends. بدونها العلاقة ناقصة."
	},
	{
		"id": 88,
		"sentence": "She sleeps ___ 10 pm.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (10 pm). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (She sleeps 10 pm) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 89,
		"sentence": "I prepare ___ the exam.",
		"correct": ["for"],
		"explanation_ar": "التحضير يحتاج هدف: تتحضر لشنو؟ (for) تربط التحضير بالهدف: prepare for the exam. بدون (for) يبقى الهدف غير واضح."
	},
	{
		"id": 90,
		"sentence": "I sing ___ I am happy.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أغني) و (أكون سعيد). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن الغناء يصير بوقت السعادة. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	},
	{
		"id": 91,
		"sentence": "The phone ___ broken.",
		"correct": ["is"],
		"explanation_ar": "broken صفة حالة. بالإنجليزي لازم فعل يربط الاسم بالحالة. (is) يربط (phone) بالحالة (broken). بدون الفعل الجملة غير صحيحة."
	},
	{
		"id": 92,
		"sentence": "You ___ wrong.",
		"correct": ["are"],
		"explanation_ar": "اسأل نفسك: هل هذا وصف/حكم؟ نعم. الحكم بالإنجليزي يحتاج فعل ربط. نضيف (are) حتى نربط (you) بالحكم (wrong). بدونها الجملة ناقصة."
	},
	{
		"id": 93,
		"sentence": "I need ___ hour.",
		"correct": ["an"],
		"explanation_ar": "hour اسم مفرد ويحتاج (a/an). نستخدم (an) لأن النطق يبدأ بصوت علّة (h ساكتة). تذكر: الاختيار حسب الصوت مو حسب الكتابة."
	},
	{
		"id": 94,
		"sentence": "We fly ___ Paris.",
		"correct": ["to"],
		"explanation_ar": "fly سفر/حركة، فلازم وجهة. (to) تربط الطيران بالمكان الهدف: fly to Paris. بدون (to) يبقى: نطير... لوين؟"
	},
	{
		"id": 95,
		"sentence": "The papers are ___ the folder.",
		"correct": ["in"],
		"explanation_ar": "اسأل نفسك: الأوراق داخل المجلد؟ نعم. (in) تبين داخل وتربط الشيء بالمكان. بدون (in) ما نعرف مكان الأوراق."
	},
	{
		"id": 96,
		"sentence": "I buy fish ___ chips.",
		"correct": ["and"],
		"explanation_ar": "اسأل نفسك: عندك شيين تريد تجمعهم بنفس الفعل؟ نعم: السمك والبطاطا. بالإنجليزي لما عندك عنصرين بنفس الجملة، لازم كلمة ربط تربطهم. (and) معناها (و) وتربط العناصر مع بعض. بدون (and) الجملة (I buy fish chips) ماكو معنى واضح لأن العناصر منفصلة بدون رابط يوضح إنهم قائمة واحدة للشراء."
	},
	{
		"id": 97,
		"sentence": "He works ___ his team.",
		"correct": ["with"],
		"explanation_ar": "اسأل نفسك: يعمل ويا من؟ هنا ويا فريق. (with) تبين التعاون/المشاركة: works with his team. بدونها العلاقة مو واضحة."
	},
	{
		"id": 98,
		"sentence": "I arrive ___ 12 noon.",
		"correct": ["at"],
		"explanation_ar": "اسأل نفسك: هذا وقت محدد لو فترة زمنية؟ وقت محدد (12 noon). بالإنجليزي الأوقات المحددة تحتاج حرف جر قبلها دائماً. (at) هو الحرف الجر المخصص للأوقات المحددة. بدون (at) الجملة (I arrive 12 noon) غير صحيحة لأن الوقت ماكو حرف جر يربطه بالفعل. هذا قاعدة ثابتة: وقت محدد = (at)."
	},
	{
		"id": 99,
		"sentence": "I care ___ you.",
		"correct": ["for"],
		"explanation_ar": "اسأل نفسك: (care) يحتاج هدف لو لا؟ يحتاج هدف. (care) يعني (أهتم) أو (أعتني)، ولازم تقول ويا من أو عن شنو تهتم. (for) تربط الاهتمام بالشخص الهدف: care for you. بدون (for) الجملة (I care you) ماكو معنى واضح لأن ما نعرف ويا من أو عن شنو تهتم. (for) ضروري حتى يكتمل المعنى."
	},
	{
		"id": 100,
		"sentence": "I stop ___ I see red light.",
		"correct": ["when"],
		"explanation_ar": "اسأل نفسك: عندك جملتين تريد تربطهم بوقت؟ نعم: (أتوقف) و (أشوف ضوء أحمر). بالإنجليزي لما عندك جملتين تريد تربطهم بوقت، لازم كلمة ربط (conjunction) توضح العلاقة الزمنية. (when) معناها (لما/عندما) وتربط الجملتين وتوضح إن التوقف يصير بوقت رؤية الإشارة. بدون (when) يصيرون جملتين منفصلتين بدون توقيت واضح."
	}
]
